app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.user_id = session[:user_id]
    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 207281424]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-09-24 11:23:41.767000"], ["updated_at", "2016-09-24 11:23:41.767000"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", "2016-10-10 06:58:02.899451"], ["product_id", 207281424], ["updated_at", "2016-10-10 06:58:02.899451"], ["user_id", 980190962]]
UPDATE "carts" SET "line_item_count" = COALESCE("line_item_count", 0) + 1 WHERE "carts"."id" = 980190963