app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-09-26 09:11:44.624736"], ["updated_at", "2016-09-26 09:11:44.624736"]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    @order.user_id = session[:user_id]

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])