app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "image_url" = ?, "price" = ?, "title" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", 19.95], ["title", "Lorem Ipsum"], ["updated_at", "2016-09-24 11:23:41.929062"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params_without_images)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 980190962 LIMIT 1
---
    def set_locale
      if session[:user_id]
        language = User.find(session[:user_id]).language