app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users"   ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-09-30 05:01:01.814487"], ["name", "sam"], ["password_digest", "$2a$04$dkxBoKS3TcMJyeTjd1YP6ey5JVoPIp1wQVbwBZetGHoc.k5/uryYC"], ["updated_at", "2016-09-30 05:01:01.814487"]]

  def destroy
    if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]